{
  "data": [
    {
      "id": "1",
      "title": "Retroid Pocket MINI Game Console, 3.7-inch 1280*960 AMOLED Screen, 6GB LPDDR4x + 128GB UFS 3.1 , Android 10, 4000mAh Battery, WiFi 6 Bluetooth 5.1, Active Cooling, 27W Fast Charge",
      "price": 109.95,
      "description": "The Retroid Pocket Mini is a recently launched handheld gaming device by Retroid Pocket, crafted to provide a compact and portable gaming experience. Powered by the Snapdragon 865 SoC, this device features a 3.7-inch OLED touchscreen with a 1280x960 resolution, ideal for those seeking a truly 'pocket-sized' gaming device. With dual analog sticks, a D-pad, and standard ABXY buttons, the Pocket Mini offers a comprehensive control scheme for various gaming genres. It also includes stacked shoulder buttons and LED joysticks, one of the most innovative features in Retroid's handheld lineup. ",
      "category": "Handheld Game Consoles",
      "brand": "Retroid",
      "code": 525139,
      "image": "https://img.gkbcdn.com/p/2024-01-10/ANBERNIC-RG35XX-H-Game-Console-64GB-128GB---Black-523294-0._w280_p1_.jpg",
      "rating": {
        "rate": 3.9,
        "count": 120
      }
    },
    {
      "id": "2",
      "title": "Tronsmart SOUNFII Q20S Hybrid ANC Headphones, Bluetooth 5.3, Hybrid Active Noise Cancellation, 60 Hours Playtime, Hi-Res Audio, 90° Swiveling Earpads, Pair with 2 Devices, Tronsmart App Control - White",
      "price": 22.3,
      "description": "The Tronsmart SOUNFII Q20S Hybrid ANC Headphones are a top-of-the-line audio device aiming to deliver an immersive listening experience. Featuring advanced hybrid active noise cancellation technology, these headphones effectively block out external noise for crystal-clear sound quality. The sleek black design adds a touch of elegance, while the comfortable ear cushions ensure long-lasting comfort during extended use. ",
      "category": "Wearable Device",
      "brand": "Tronsmart",
      "code": 525137,
      "image": "https://img.gkbcdn.com/p/2024-10-17/dce72ff89325443c808fcfb878e39a74-526016-0._w280_p1_.jpg",
      "rating": {
        "rate": 4.1,
        "count": 259
      }
    },
    {
      "id": "3",
      "title": "GameSir G8 Plus Bluetooth Game Controller, 6Axis Gryo, Hall Effect Sticks, 1000mAh Battery, Retractable Length 4.72-8.46inches, Compatible with Switch / iOS / Android / Tablet / PC",
      "price": 55.99,
      "description": "Gamesir G8 and Gamesir G8 Plus are two gaming controllers designed for mobile devices. Both controllers have a similar design with a sleek and ergonomic shape that fits comfortably in the hands of the users. Both controllers feature Hall Effect sticks for precise and smooth movement control. They also have analog and hair trigger modes for customizable gameplay experiences. The controllers come with membrane face buttons and a D-pad with a tactile switch for responsive and accurate inputs. Additionally, they both have 2 back buttons for additional control options, a turbo function for rapid button presses, and the ability to interchange key values for personalized settings. Both controllers also have a capture function for easily capturing and sharing gameplay moments.",
      "category": "Gaming Controller",
      "brand": "Gamesir",
      "code": 525112,
      "image": "https://img.gkbcdn.com/p/2024-07-12/One-Netbook-OneXPlayer-X1-8840U-Handheld-Gaming-PC-32GB-1TB-US-Plug-525102-0._w280_p1_.jpg",
      "rating": {
        "rate": 4.7,
        "count": 500
      }
    },
    {
      "id": "4",
      "title": "GPD Pocket 3 Handheld Laptop, Intel Gold 7505 2 Cores Max 3.5GHz, 8'' 1920*1200 IPS Touchscreen, 16GB RAM 512GB SSD, 10000mAh Battery, WiFi6E Bluetooth5.3, 1*Thunderbolt 4 1*HDMI 2.0b 1*USB 3.2 Gen2 Type-A 2*USB 3.2 Gen1 Type-A 1*RJ45 - EU Plug",
      "price": 15.99,
      "description": "8-inch IPS screen, 1920×1200 resolution, 284ppi pixel density, 16:10 ultra-wide viewing angle, 500nit brightness, DC dimming and billions of brilliant colors, allowing you to enjoy viewing pleasure.Pocket 3 is equipped with the Intel 11th generation Pentium Gold 7505 processor, 2 cores and 4 threads, turbo frequency up to 3.5GHz, all-core up to 3.3GHz, easily handles mainstream office software and 4K Blu-ray movies, making it suitable for both work and entertainment.Pocket 3 is equipped with 16GB dual-channel LPDDR4x high-speed memory and 512GB M.2 2280 solid-state drive to meet your storage needs and say goodbye to the problems of lag and slow reading and writing speeds.Pocket 3 has a built-in 10000mAh (38.5Wh) large-capacity battery, strong battery life and 65W PD fast charging capability, allowing you to fully devote yourself to work.",
      "category": "Gaming Laptop",
      "brand": "GPD",
      "code": 482673,
      "image": "https://img.gkbcdn.com/p/2024-07-11/GPD-WIN-Max-2-Handheld-Gaming-PC-64GB-2TB-US-Plug-525098-0._w280_p1_.jpg",
      "rating": {
        "rate": 2.1,
        "count": 430
      }
    },
    {
      "id": "5",
      "title": "Furbulous Automatic Self-Cleaning and Self-Packing Cat Litter Box, Smarter Care with App Control, 60L Large Capacity, Auto-Cleaning, Perfect for Large-sized Cats and Multi-cats Family (Upgraded)",
      "price": 695,
      "description": "Unlike other cat litter boxes that require pet owners to manually scoop cat waste, this cat litter box executes all procedures automatically—including automated cleaning, packing, and sealing the plastic bag. It takes the honor of being the market's first truly automatic cat litter box.This genuinely automated cat litter box is also accompanied by a smart app, elevating hands-free functionality to an even higher standard. It allows you to not only remotely manage the cleaning schedule of the litter box but also effectively track your cat's weight, bathroom visits, and more. Truly realizing a fully intelligent solution.Our foremost concern is your cat's safety, and thus we've implemented a Lifeguard System including a total of 7 safety sensors and an anti-pinch structure. Whether your cat is inside the litter box or nearby, this smart cat litter box can detect their presence and will block the door from opening, ensuring your cat remains unharmed. Important: To use the automatic cleaning feature, your cat must weigh at least 3 pounds. If you have a small kitten, please disable the automatic cleaning function until they reach the minimum weight.",
      "category": "Pet Supplies",
      "brand": "Furbulous",
      "code": 783921,
      "image": "https://img.gkbcdn.com/p/2024-07-17/Furbulous-Auto-Pack---Seal-Cat-Litter-Box-525144-0._w280_p1_.jpg",
      "rating": {
        "rate": 4.6,
        "count": 400
      }
    },
    {
      "id": "6",
      "title": "GPD DUO 13.3-inch Dual-OLED Screen Laptop, AMD Ryzen AI 9 HX 370 (12 Core Max 5.1GHz), 2880*1800, 32GB LPDDR5 RAM 1TB SSD, WiFi 6E Bluetooth 5.3, Built-in Hyper-Linear Speakers, 1*USB4 (40Gbps), 1*USB-C (10Gbps), 1*Oculink, 1*HDMI 2.1, 2*USB-A",
      "price": 168,
      "description": "Outstanding color performance and stunning contrast bring an unprecedented visual feast. Every pixel shines to create delicate and vivid images with vibrant, full-color details, clear details, and natural color transitions.Utilizing advanced 4nm manufacturing process, ZEN 5 + RDNA 3.5 + XDNA 2 architecture, experience cutting-edge artificial intelligence (AI) technology, accelerate multitasking, boost productivity, foster collaboration, and enhance efficiency.AMD Radeon 890M integrated graphics, based on the all-new RDNA 3.5 architecture, integrates 16 CUs with 1024 sp, delivering a 33% improvement in specifications compared to the previous generation, resulting in a 36% increase in gaming performance! Combined with LPDDR5x 7500 MT/s memory, the graphics memory bandwidth has also been enhanced.",
      "category": "Gaming Laptop",
      "brand": "GPD",
      "code": 482635,
      "image": "https://img.gkbcdn.com/p/2024-07-11/GPD-Pocket-3-Handheld-Laptop-PC-525099-0._w280_p1_.jpg",
      "rating": {
        "rate": 3.9,
        "count": 70
      }
    },
    {
      "id": "7",
      "title": "USB 3.0 SD Card Reader 5Gbps Transmission Speed for TV, Laptop, Computer, Camera - Black",
      "price": 9.99,
      "description": "Using the USB3.2 Gen1 high speed transmission protocol, High-speed USB3.2 Gen1 Performance of Read Speed Max 405MB/s, Write speed up to 350MB/s.With write speeds of up to 15X faster than standard USB 2.0 drives, you can transfer 1 GB File in less than 3 seconds.PS: The ORICO UFSD USB 3.0 Flash Drive is backward-compatible with USB 2.0, so you can plug it into any USB2.0 or 3.0 port.UFSD USB3.2 Gen1 Flash Drive Read 60GB file in the test environment of ORICO Laboratory, Transmission speed is stable 360° rotation protecting cap design prevents cap loss, and 90° stuck point design avoids the drive rotates randomly. Besides, you can hang it on a key chain with humanized hanging ring design.",
      "category": "USB Gadgets",
      "brand": "Orion",
      "code": 481235,
      "image": "https://img.gkbcdn.com/p/2024-07-15/MINIX-CP86-Wired-CarPlay-to-Wireless-Adapter-525127-0._w280_p1_.jpg",
      "rating": {
        "rate": 3,
        "count": 400
      }
    },
    {
      "id": "8",
      "title": "Anker Soundcore Sport X10 TWS Earbuds for Workout - Black",
      "price": 10.99,
      "description": "Twist the 210° rotatable ear hooks until you find the perfect spot for your ears. The unique design and lightweight build keeps Sport X10 workout earbuds comfortably and securely in place throughout your workout.The dynamic acoustic system delivers 2x more bass while preserving the clarity of mids and treble. BassUp technology analyzes and enhances your music's bass in real-time for an extra boost.Sport X10 workout earbuds have a fully waterproof, IPX7-rated build that stops liquids in their tracks. For further protection, our exclusive SweatGuard technology defends against the corrosive properties of sweat.Get 8 hours of music from a single full charge of the workout earbuds and the charging case provides up to 32 hours of extra power. A speedy 10-minute charge gives you up to 2 hours of listening.Bluetooth 5.2 ensures that your Sport X10 workout earbuds maintain a consistently stable connection with your device throughout your workout.Sport X10 are small and lightweight to ensure they're comfortable for long listening sessions. The slim charging case easily fits in your pocket or gym bag, without taking up lots of space.",
      "category": "Wearable Device",
      "brand": "Anker",
      "code": 298653,
      "image": "https://img.gkbcdn.com/p/2024-06-26/Houtonsen-S3-Motorcycle-Helmet-Bluetooth-Headset-524965-0._w280_p1_.jpg",
      "rating": {
        "rate": 1.9,
        "count": 100
      }
    },
    {
      "id": "9",
      "title": "BMAX B5 A Pro Mini PC, AMD Ryzen 7 5825U 8 Cores Max 4.5GHz, 16GB RAM 512GB SSD, DP+HDMI+Type-C 4K Triple Display, Support Dynamic HDR, WiFi 5 Bluetooth 5.0, 2*USB 3.2 2*USB 2.0 1*RJ45 1*3.5mm Headset Jack, Space Capsule Cooling System - EU Plug",
      "price": 64,
      "description": "BMAX B5 A Pro mini PC uses AMD Ryzen 7 5825U with a burst frequency of up to 4.5GHz, which has powerful loading and processing capabilities and reduces latency for a smoother experience. The AMD Radeon GPU provides powerful graphics processing capabilities to easily handle the most intense games.BMAX B5 A Pro mini PC is equipped with 16GB RAM for faster multitasking and smooth application switching, and supports up to 64GB memory expansion. The 512GB SSD ensures fast boot time, fast file transfer and ample storage space, eliminating slow loading times and ensuring fast responsiveness.BMAX B5 A Pro mini PC supports dual-band WiFi for ultra-fast wireless connection for smooth streaming and fast downloading. Built-in Bluetooth 5.0 can be easily paired with a variety of peripherals, such as wireless keyboards, mice, headphones, surveillance cameras, printers, monitors, TVs, projectors, etc.Supports DP+HDMI+Type-C 4K@60Hz triple-screen display, providing high-definition video output and multi-tasking flexibility. With 2 USB 3.2 and 2 USB 2.0 ports, seamless data transfer and device connection are easily achieved. The RJ45 port ensures a stable wired network connection, which is ideal for high-speed Internet access during missions that require reliability.BMAX B5 A Pro mini computer adopts the new space capsule cooling system with efficient cooling function, which can release higher performance and create an energy-saving and quiet working environment.",
      "category": "Windows Mini PCs",
      "brand": "BMAX",
      "code": 297526,
      "image": "https://img.gkbcdn.com/p/2024-09-13/BMAX-B5-A-Pro-Mini-PC-16GB-512GB-525725-0._w280_p1_.jpg",
      "rating": {
        "rate": 3.3,
        "count": 203
      }
    },
    {
      "id": "10",
      "title": "Touroll B1 Electric City Bike, 250W Motor, 45Nm Torque, 26x1.95 Tire, 36V 15.6Ah Battery, 90km Max Range, 7-Speed Shimano Gear 5 Assist Levels 6km/h Walk Mode, Mechanical Shock Absorber IPX4 - Black",
      "price": 109,
      "description": "The Touroll B1 features a powerful 250W brushless motor that produces 45N.M of torque and can reach a cut-off speed of 25 km/h. With its powerful motor, it can provide a more exhilarating riding experience.With a 15.6Ah removable battery and a maximum range of 90 km, the Touroll B1 e-bike caters to all your riding needs, from daily commuting to day trips.Equipped with 26x1.95 premium pneumatic rubber tires and reliable suspension, the B1 e-bike offers enhanced traction and stability. And Shimano's 7-speed shifting system provides ample gear options to adapt to different riding conditions.The B1 e-bike offers 5 pedal assist levels, including 12, 15, 18, 21, and 25 km/h, along with a 6 km/h walk mode for customizable rides. Stay informed with the LED instrument displaying gear and power levels, enriching your riding experience.StVZO-certified safety lamps guarantee visibility and safety in low-light conditions, while also preventing glare to ensure the safety of other passers-by. These eco-friendly lamps meet the rigorous standards of the German road regulations. The ergonomic frame design and adjustable stem guarantee a comfortable riding position.The rear rack easily accommodates your backpack and essentials, enhancing riding convenience. Front and rear fenders shield against water and mud splashes, making the B1 electric bike your ideal daily companion!",
      "category": "Bikes",
      "brand": "Touroll",
      "code": 186726,
      "image": "https://img.gkbcdn.com/p/2024-07-15/honeywhale-s6-pro-14-inch-48v-15ah-battery-350w-motor-electric-bike-30ae81-1721039521089._w280_p1_.jpg",
      "rating": {
        "rate": 2.9,
        "count": 470
      }
    },
    {
      "id": "11",
      "title": "SCULPFUN S30 Pro Max 20W Laser Engraver + Rotary Roller + Laser Bed",
      "price": 109,
      "description": "Sculpfun S30 Pro Max equips a 20W quad-diode laser module with a replaceable protective lens underneath that will make it possible to keep your engraver in top condition for many years!Sculpfun S30 Pro Max uses the same focusing method as the brand`s models including the Sculpfun S10 and Sculpfun S9. The laser module is held on a sliding rail with thumbscrews on the back. The focusing is done by setting the correct distance between the laser module and the work material with an aluminum focusing block, which sets the distance to 40mm.The air assist pump of the Sculpfun S30 Pro Max outputs 30 l/min and can be enabled via control software (Lightburn) for only the specified engraving layers. This is great because you can engrave one project that has multiple operations and for example, you can select to turn off the air assist for engraving and turn it on for laser cutting only. The air assist pump already comes with the machine.Sculpfun S30 series is equipped with an air-assist 32-bit motherboard and a control-type air pump, which can intelligently control the air-assist switch during engraving through the LightBurn software M8 button, this makes the engraving and cutting very clean, and is very suitable for the manufacture of exquisite gifts.S30 series is equipped with an advanced high-pressure air-assisted metal nozzle, which can generate 30L/min high-pressure airflow under the air pump, greatly improving the cutting efficiency, and the cutting speed is more than 5 times faster than that without air assist.Adopting ultra-thin laser shaping technology, the laser focus of the S30 series is as thin as hair and very powerful for engraving or cutting. The S30 Pro Max 20W pursues the ultimate cutting speed, suitable for professionals, shops, or factories.S30 series laser adopts an innovative replaceable lens, which greatly improves the service life of the laser, which is more than 10 times longer than other general lasers. When the lens is damaged or after long-term use, the lens can be replaced to restore the cutting power.The original engraving area is about 410x400mm, while it features XY-axis expandable design, so you can purchase a Y-axis expansion kit to expand the engraving area to 935x400mm; purchase an XY-axis expansion kit to upgrade up to 935x905mm engraving area, which can help you better handle large area engraving or cutting work.The latest 32-bit motherboard supports automatic air-assist control and reserves Bluetooth, and SD card offline printing function. (Upgrade Kit sold separately) Industrial-grade Cutting Accuracy Extremely solid and high-precision linear slide rail X-axis make it reach industrial-grade engraving accuracy. When comparing small engraving details, the S30 series does not have the wavy pattern that appears in ordinary engraving machines.Made of high-strength aluminum alloy, its frame can bear up to 50 kg weight without damage and is very durable. The frame can be used for a long time and maintain high precision, only need to upgrade the latest laser when the machine needs to be upgraded.The presented A4 size steel pad can well protect the table from laser damage. There is an eye-catching power switch on the machine, you can directly and quickly turn off the power in an emergency.There are precise scale lines on the X-axis and Y-axis to form a right-angle measuring ruler, which is convenient for you to quickly measure the size of the engraved object.",
      "category": "Consumer Electronics",
      "brand": "SCULPFUN",
      "code": 525942,
      "image": "https://img.gkbcdn.com/p/2024-07-15/mecpow-x4-22w-laser-engraver-cutter-c6cc46-1721039565388._w280_p1_.jpg",
      "rating": {
        "rate": 4.8,
        "count": 319
      }
    },
    {
      "id": "12",
      "title": "ANBERNIC RG556 Game Console with 8714 Games, 8GB LPDDR4X /128GB UFS2.2 /256GB TF Card, Android 13, 5.48 1080P AMOLED Touch Screen with 402PPI, Unisoc T820 Octa-core, AC WIFI + Bluetooth 5.0, Moonlight Streaming, 8 Hours Playtime - Black",
      "price": 114,
      "description": "Anbernic RG556, a 5.48-inch Android-based emulation handheld with an AMOLED display powered by the Unisoc T820 processor, is powerful enough to emulate most retro games on the device. The RG556 is powered by a Unisoc T820, 8GB of RAM, and 128GB of internal storage. All are powered by a 5500mAh battery and runs a 5.48-inch AMOLED display at 1920×1080. It’s got the usual Wi-Fi channels and Bluetooth 5.0, in addition to the display output over the Type C port, which honestly, is a nice inclusion.The 5500mAh battery provides up to 8 hours of playtime. Wireless connectivity includes WiFi 2.4/5G 802.11 a/b/g/n/ac and Bluetooth 5.0.The operating system is Android 13 and supports 30+ emulators. Other features include a six-axis gyroscope sensor for tilt control and vibration motor, support for 1080p display port output, and moonlight streaming. With grips and an asymmetric joystick layout, the RG556 could be Anbernic’s best handheld for playing retro games yet.",
      "category": "Handheld Game Consoles",
      "brand": "ANBERNIC",
      "code": 523768,
      "image": "https://img.gkbcdn.com/p/2024-06-28/M25-Handheld-Game-Console-64GB-TF-Card-524983-0._w280_p1_.jpg",
      "rating": {
        "rate": 4.8,
        "count": 400
      }
    },
    {
      "id": "13",
      "title": "KuKirin G3 Electric Scooter 10 Inch Off-road 1200W Motor 52V 18Ah Lithium battery Max Speed 50km/h LED Touch Display, Shock arm Suspension 63km Max Range IP54 Waterproof 6-Lights",
      "price": 599,
      "description": "The frame is made of high-strength aluminum alloy and designed in one piece with no welds, which is solid and good-looking. Thanks to the all-in-one design, KuKirin G3 is tougher and more durable, perfect for your cross-country ride! The 1200W powerful motor with dual heat dissipation provides you with constant and strong power, enabling the e-scooter to speed up to 50km/h. Running with G3, your ride will be more powerful and more durable.Equipped with an 18Ah large lithium-ion battery pack, KuKirin G3 can run up to 60km on a full charge, which is definitely a great partner for your long-distance ride!Thanks to the strong power supply, KuKirin G3 is able to adapt to a variety of terrains and climb an uphill slope of 30°. Your cross-country ride will have more fun and excitement.The advanced LED touch display is designed to show various real-time data, such as speed and battery power, and also for multi-function control, which makes your ride smarter, easier and more interesting.",
      "category": "Electric Scooters",
      "brand": "KuKirin",
      "code": 473290,
      "image": "https://img.gkbcdn.com/p/2024-07-12/YUME-X11--Electric-Scooter-3000W-27AH-525106-0._w280_p1_.jpg",
      "rating": {
        "rate": 2.9,
        "count": 250
      }
    },
    {
      "id": "14",
      "title": "Mecpow X3 Pro 10W Laser Engraver With Air Assist System + H44 Laser Bed",
      "price": 999.99,
      "description": "Mecpow X3 Pro is one of the world's first 10W laser engravers with an air assist system included, therefore its cutting capacity is greatly improved compared to its counterparts. Plus, the cutting accuracy and cutting quality are also optimized to a great extent.The Mecpow X3 Pro adopts a 10W diode laser with a small focus of 0.06x0.08mm and an engraving accuracy of 0.01mm. The small spot size, along with short pulses, produces high peak power, which can achieve more accurate and deeper engraving and cutting.It can cut a wood board with a 20mm thickness and an acrylic board with a 15mm thickness.The X3 Pro machine boasts a flame sensor and a gyroscope sensor, which can trigger the alarm and stop the machine’s operation in the event of fire or tilting more than 50±5 degrees. Besides, limit switches are included to prevent accidents and reduce wear by stopping the machine from moving beyond its safe limits, leading to a longer lifespan of the laser engraver. Furthermore, you can stop the machine anytime by pressing the emergency stop button and lock the machine to keep it safe from unwanted use, which is especially handy if you have kids around.With a maximum air flow of 30 liters per minute, the air pump effectively removes debris and smoke for a cleaner cut. It also prevents the buildup of combustible materials, reducing the risk of fire and providing a safer engraving experience. Plus, with its adjustable knob, you can easily regulate the airflow according to the density of the smoke for a smokeless and odorless workspace.The X3 Pro laser engraver comes with a fixed-focus laser that saves you time in adjusting the focus and a focusing screen that helps you move the laser head to the correct position. Slide down the laser head till it touches the focusing screen on the object and then remove the focusing screen.The laser engraving machine is equipped with a laser shield on the laser module, which can filter out diffuse light from the laser spot to a large extent. A pair of laser safety goggles is also included for better eye protection.The X3 Pro engraving machine can be used for engraving on a variety of materials, including wood, acrylic, leather, bamboo, fabric, stainless steel, etc. It is compatible with LaserGRBL (Windows only) and LightBurn (Windows and Mac OS), supporting various file formats, including JPG, PNG, DXF, TIF, PDF, SVG, AI, NC, BMP, etc. ",
      "category": "Consumer Electronics",
      "brand": "Meckpow",
      "code": 525246,
      "image": "https://img.gkbcdn.com/p/2024-08-13/mecpow-x3-pro-10w-laser-h44-laser-bed-combo-5a207a-1723541950468._w280_p1_.jpg",
      "rating": {
        "rate": 2.2,
        "count": 140
      }
    },
    {
      "id": "15",
      "title": "TITAN ARMY P27GR Gaming Monitor, 27-inch 2560*1440 16:9 Fast IPS Screen, 180Hz Refresh Rate, 1ms GTG, 99% sRGB, HDR10, Adaptive-Sync, Gaming Mode, Dynamic OD, PBP & PIP Display, Low Blue Light, Adjustable Tilt, VESA Wall Mounting",
      "price": 56.99,
      "description": "The Titan Army P27GR features a fast IPS panel that ensures lightning-fast response times of 1ms GTG. This eliminates screen tearing and ghosting, providing a smooth and seamless gaming experience. With a 180Hz refresh rate, you can face the fiercest competition with confidence and clarity.The 27-inch screen offers 2K QHD resolution (2560x1440) with 108 PPI, revealing every detail with remarkable clarity. This golden size is perfect for various scenarios, including gaming, watching movies, editing, and design work, making it a versatile choice for all your visual needs.Covering 99% of the sRGB color gamut and supporting 1.07 billion colors, the Titan Army P27GR delivers rich, vivid, and accurately reproduced images. HDR10 technology enhances dynamic range, providing stunning visuals with deep contrasts and vibrant colors for a truly immersive experience.The monitor combines low blue light LEDs with software filtering to reduce harmful blue light, minimizing eye strain. DC Dimming Technology ensures a flicker-free, comfortable, and healthier viewing experience, allowing for prolonged use without discomfort.Enhance your gaming experience with Game+ features such as customizable crosshairs, real-time refresh rate monitoring, and a stopwatch for tracking game time. With 10 intelligent scene modes, including Night Vision Mode and Game Dark Enhancement, you can personalize your display for optimal performance in any situation.Equipped with sPX Mode, the Titan Army P27GR supports 4K 60Hz+HDR+VRR+ALLM for console connections, ensuring high-quality visuals and smooth gameplay. The PIP/PBP function allows simultaneous display of two video signals, making it perfect for multitasking and enhancing productivity",
      "category": "Monitors",
      "brand": "TITAN ARMY",
      "code": 287643,
      "image": "https://img.gkbcdn.com/p/2024-07-10/TITAN-ARMY-P2510S-Fast-IPS-QHD-240Hz-Gaming-monitors-525071-0._w280_p1_.jpg",
      "rating": {
        "rate": 2.6,
        "count": 235
      }
    },
    {
      "id": "16",
      "title": "KTC H27S17 27-inch 1500R Curved Gaming Monitor QHD 2560x1440 16:9 ELED 180Hz 120% sRGB 4000:1 Contrast Ratio 1ms MPRT Response Time Low Motion Blur Compatible with FreeSync G-Sync USB 2xHDMI2.0 2xDP1.4 Audio Out VESA Mount",
      "price": 29.95,
      "description": "The 27-inch screen features a 1500R curvature, following the natural curvature of your field of view more closely for a more immersive and comfortable experience. With a QHD resolution of 2560x1440, it delivers crisp, vibrant visuals for a stunning level of detail.Enjoy buttery-smooth gameplay with the H27S17's 180Hz refresh rate and 1ms (MPRT) response time. This high-performance monitor ensures minimal motion blur and instant response, perfect for competitive gaming.Covering 120% of the sRGB color gamut and supporting HDR10, the KTC H27S17 offers deeper, richer colors and enhanced contrast, providing true-to-life visuals that bring your games and media to life.Compatible with FreeSync and G-Sync, the H27S17 eliminates screen tearing and stuttering for a seamless, fluid gaming experience, ensuring smooth visuals in every frame.Protect your eyes during long gaming sessions with the H27S17's low blue light mode, which minimizes harmful blue light emissions. The monitor also operates without flicker, ensuring a comfortable viewing experience.The H27S17 offers a range of connectivity options, including USB 2.0, HDMI 2.0, and DP 1.4 ports, to accommodate various devices. Its sturdy stand and wall-mount capability provide flexible placement options, while the tilt functionality allows for customized view",
      "category": "Monitors",
      "brand": "KTC",
      "code": "517385",
      "image": "https://img.gkbcdn.com/p/2024-06-26/TITAN-ARMY-C49SHC-Gaming-Monitor-524956-0._w280_p1_.jpg",
      "rating": {
        "rate": 2.9,
        "count": 340
      }
    },
    {
      "id": "17",
      "title": "Narwal Freo X Ultra Robotic Vacuum and Mop with Auto Washing and Self-Empty, Strong 8200Pa Suction Power, Zero-Tangling Floating Brush, Automated Mop Lifting To 12mm, All-in-One Base Station",
      "price": 39.99,
      "description": "Don’t sacrifice cleanliness for convenience. Freo X Ultra is a robot vacuum with suction so powerful it leaves hard floors and carpets spotless. Chips, fur, cereal, dust, and debris don’t stand a chance—even when buried in deep carpet.A revolutionary innovation that holds a conical cleaning brush on a single floating arm. Instead of getting trapped, hair and pet fur are passed directly into the dust bag. SGS and TÜV certified, Freo X Ultra has a 0% tangle rate with 99.5% of hair getting instantly removed.Patented Rouleaux robot mop heads leave no gaps and press down with 12N and spin at 180RPM to scrub away stubborn stains. It features AI DirtSense technology that knows when your floors are clean and keeps scrubbing until they are. EdgeSwing Technology enables it to clean up to the edge and reach every corner of your house.The included base station is a fully equipped hands-free maintenance center. It automatically washes, dries, and refills the mops with detergent and water. Then it cleans and dries itself and offers easy control of Freo X Ultra’s robot vacuum and mop functions.Ordinary robot cleaners self-empty their dust into their base station—a noisy and messy process. Freo X Ultra has a built-in system that compresses the dust for 7 weeks of maintenance-free cleaning with a disposable dust bag for effortless and clean disposal (collecting into a standard dust bin is also available).Paired with industry-leading mapping technology, Freo X Ultra avoids even small and low-lying objects thanks to millimeter-precision lasers. It uses side sensors to hug obstacles and clean up to the edge. ",
      "category": "Smart Home",
      "brand": "Narwal",
      "code": 862435,
      "image": "https://img.gkbcdn.com/p/2024-03-21/narwal-freo-x-ultra-robot-vacuum-cleaner-eu-plug-43637b-1710989588823._w280_p1_.jpg",
      "rating": {
        "rate": 3.8,
        "count": 679
      }
    },
    {
      "id": "18",
      "title": "Techni Home Office PU Leather Adjustable Rotatable Gaming Chair with Ergonomic High Backrest and Lumbar Support",
      "price": 9.85,
      "description": "The Techni Sport TS-5100 Ergonomic Office High Back Computer Racing Gaming Chair features an eye-catching racer-style design that will spruce up any environment.Swivel and recline in superb comfort for long gaming play or work sessions.This ultimate computer gaming chair is made with synthetic TechniFlex upholstery and features a height-adjustable memory foam seat, reclining back mechanism up to 150 degrees, tilt & tension mechanism control, ergonomic and adjustable headrest and lumbar support cushions, height adjustable and swivel armrests and a durable steel base with non-marking 2 casters. ",
      "category": "Chairs",
      "brand": "Techni",
      "code": 164325,
      "image": "https://img.gkbcdn.com/p/2024-07-22/newtral-magich002-ergonomic-chair-0e2a95-1721628752996._w280_p1_.jpg",
      "rating": {
        "rate": 4.7,
        "count": 130
      }
    },
    {
      "id": "19",
      "title": "ORICO 6 in 1 Type-C Multi-function Docking Station",
      "price": 7.95,
      "description": "Connect to the latest MacBook Pro or USB-C devices with the USB-C hub featuring a charging port with power delivery(5V2A), a 4K HDMI-compatible port, SD TF, PD and USB 3. 0 ports. Data transmission speed up to 5Gbps.ORICO USB C hub is equipped with an SD and TF slot, back up your camera or mobile phone data in a flash at data transfer speeds up to 5Gbps. SD and TF cards cannot be read at the same time.USB Type C hub charges you for MacBook Pro or other Type-C devices while connecting 55W power delivery port. With power delivery, a single USB-C port can give you Blazing-fast charging speed experience. Support PD 3.0/2.0 fast charge for laptop. Stream 4K UHD video to an HDTV, laptop, monitor, or projector. Very suitable for displaying PowerPoint presentations on a projector in an office meeting, watching high-definition movies on a high-definition television or extending 3D video games to the monitor for a cinema-like visual feast.Just plug and play without installing any driver. Thin and sleek Design whether you are working, studying or traveling, you will carry it easily and quickly put it into use 1. The USB 3.0 Port DOES NOT recommend charging. It supports data transmission and the speed is up to 5Gbps, sync music, movies, large files in seconds. 2. The resolution of HDMI-compatible output depends on the device. Only when the device supports 4K resolution (AMD + DP1.4), the video output can reach 4K. 3. The TF and SD Card cannot be read at the same time 4K HDMI-compatible port, SD TF, PD and USB 3. 0 ports",
      "category": "Wireless Chargers",
      "brand": "ORICO",
      "code": 652343,
      "image": "https://img.gkbcdn.com/p/2024-07-10/jimmy-battery-pack-for-pw11-pro-pw11-pro-max-101169-1720606225989._w280_p1_.jpg",
      "rating": {
        "rate": 4.5,
        "count": 146
      }
    },
    {
      "id": "20",
      "title": "JOYOR S10-Z Electric Scooter 10 Inch Off-road Tires 60V 18Ah Battery 1000W*2 Dual Motor 70-85KM Range 120KG Load Double Hydraulic Disc Brakes Shock absorber Turn signal Smart LED Display update from S10-S - Black",
      "price": 12.99,
      "description": "Several 18650 high-capacity lithium batteries deliver up to 85km of travel on a single charge. Smart battery management via the LCD displays the health of the battery pack and notifies you immediately if there are issues.Every aspect of the S10-Z is crafted with simplicity in mind. The scooter frame, components and accessories use the same geometric design language that puts usability and the user at the front. A single button kicks the scooter to life and the red design accents add modernity. The S10-Z is made to look right and feel right.The sturdy frame is made of aerospace-grade aluminum, which has a low density and high structural strength. It also has excellent thermal conductivity and corrosion resistance for added durability.Give the accelerator a gentle downward push and adjust the amount of pressure until you reach a comfortable speed.Headlights are essential for night riding, yet not all scooters have them. The S10-Z features ultra-bright 1.1W headlights with a range of up to 6 meters for added safety.The large 10-inch front and rear tires have great shock absorption and anti-slip treads. Coupled with a 2*1000W brushless DC motor for stable power output, The S10-Z is set to deliver a smoother riding experience.Using the core cruise control technology in cars, our electric scooter uses a unique algorithm that receives signal input from speed sensors to maintain smooth and stable cruise control. This reduces tension and fatigue for riders, as well as optimizes battery for longer rides.Smart LED Display can show more data, support multi-functions Secure Password Setting, Gear Shift, and single/dual drive switch.",
      "category": "Electric Scooters",
      "brand": "JOYOR",
      "code": 165324,
      "image": "https://img.gkbcdn.com/p/2024-05-31/joyor-s10-s-electric-scooter-10in-60v-18ah-2-1000w-motor-65km-h-black-700fa8-1717137126179._w280_p1_.jpg",
      "rating": {
        "rate": 3.6,
        "count": 145
      }
    }
  ],
  "cart": [
    {
      "id": "8",
      "title": "Anker Soundcore Sport X10 TWS Earbuds for Workout - Black",
      "image": "https://img.gkbcdn.com/p/2024-06-26/Houtonsen-S3-Motorcycle-Helmet-Bluetooth-Headset-524965-0._w280_p1_.jpg",
      "description": "Twist the 210° rotatable ear hooks until you find the perfect spot for your ears. The unique design and lightweight build keeps Sport X10 workout earbuds comfortably and securely in place throughout your workout.The dynamic acoustic system delivers 2x more bass while preserving the clarity of mids and treble. BassUp technology analyzes and enhances your music's bass in real-time for an extra boost.Sport X10 workout earbuds have a fully waterproof, IPX7-rated build that stops liquids in their tracks. For further protection, our exclusive SweatGuard technology defends against the corrosive properties of sweat.Get 8 hours of music from a single full charge of the workout earbuds and the charging case provides up to 32 hours of extra power. A speedy 10-minute charge gives you up to 2 hours of listening.Bluetooth 5.2 ensures that your Sport X10 workout earbuds maintain a consistently stable connection with your device throughout your workout.Sport X10 are small and lightweight to ensure they're comfortable for long listening sessions. The slim charging case easily fits in your pocket or gym bag, without taking up lots of space.",
      "price": 10.99,
      "quantity": 3,
      "rating": {
        "rate": 1.9,
        "count": 100
      }
    },
    {
      "id": "5",
      "title": "Furbulous Automatic Self-Cleaning and Self-Packing Cat Litter Box, Smarter Care with App Control, 60L Large Capacity, Auto-Cleaning, Perfect for Large-sized Cats and Multi-cats Family (Upgraded)",
      "image": "https://img.gkbcdn.com/p/2024-07-17/Furbulous-Auto-Pack---Seal-Cat-Litter-Box-525144-0._w280_p1_.jpg",
      "description": "Unlike other cat litter boxes that require pet owners to manually scoop cat waste, this cat litter box executes all procedures automatically—including automated cleaning, packing, and sealing the plastic bag. It takes the honor of being the market's first truly automatic cat litter box.This genuinely automated cat litter box is also accompanied by a smart app, elevating hands-free functionality to an even higher standard. It allows you to not only remotely manage the cleaning schedule of the litter box but also effectively track your cat's weight, bathroom visits, and more. Truly realizing a fully intelligent solution.Our foremost concern is your cat's safety, and thus we've implemented a Lifeguard System including a total of 7 safety sensors and an anti-pinch structure. Whether your cat is inside the litter box or nearby, this smart cat litter box can detect their presence and will block the door from opening, ensuring your cat remains unharmed. Important: To use the automatic cleaning feature, your cat must weigh at least 3 pounds. If you have a small kitten, please disable the automatic cleaning function until they reach the minimum weight.",
      "price": 695,
      "quantity": 1,
      "rating": {
        "rate": 4.6,
        "count": 400
      }
    }
  ],
  "users": [
    {
      "id": "6d58",
      "email": "salinibarai97@gmail.com",
      "password": "asdfghjk"
    }
  ]
}